from unicodedata import name


# print()
# #ტერმინალში გამოაქვს ფრჩხილებში გადაცემულ არგუმენტს


# input()
# #ტერმინალში გამოქვს ველი სადაც შეგვიძლია შევიყვანოთ მონაცემები და შეყვანილი მონაცემები მიენიჭება რაიმე ცვლადების მნიშვნელობას

# for i in range(5, 12, 2):
#     print(i)
#რეინჯით ვუთითებთ იტერაციების რაოდენობას 

# def - define
# def say_hello(name):
#     print("gamarjoba", name)

# say_hello(name="nika")
# say_hello(name="luka")

#ფუნქცია არის reusable piece of code


#ფუნქციის ალგორითმი არის ინსტრუქციების მიმდევრობა, რომელიც გვისრულებს რაღაცა მიზანს


#საათში ვწერ 2 ლარის დენს, რამდენი ლარი მექნება გადასახდელი, თუ დენს გამოვიყენებ x საათის განმავლობაში

#  x არის საათის ცვლადი
# def calculate_bill(x):
#     print( x * 2 )


# calculate_bill(30)

# def my_sum(x, y):
#     print(x + y)

# my_sum(10, 3)

#შექმენით ფუნქცია რომელიც მიიღებს 3 რიცხვს და დაგვიბრუნებს სამივეს კვადრატების ჯამს 
#მაგალითად 2, 4, 5 ---- 4 + 16 + 25  

def my_total(x, y, z):
    print(x*x + y*y + z*z)
my_total(4, 5, 6)